adviceForUndergradMajors.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Advice for major advisees</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-18 17:23:51 EDT"/>
<meta name="author" content="David Zureick-Brown"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Advice for major advisees</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 General advice. </a></li>
<li><a href="#sec-2">2 Once you have taken 250 </a></li>
<li><a href="#sec-3">3 If you are thinking of going to grad school in theoretical math </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> General advice. </h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>
Take as many of the 100 and 200 level classes as you can, as early as you can.
</li>
<li>
Take 250 (Foundations of math) as soon as possible
</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Once you have taken 250 </h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>
If you took 250 in the fall, take 321 (Vector Spaces)
</li>
<li>
If you took 250 in the Spring and are doing a 
<ul>
<li>
pure math BS
<ul>
<li>
take 318 (Complex Analysis)
</li>
<li>
take some non-empty subset of 421 (Abstract algebra) and 411 (Real Analysis). 
</li>
<li>
if you're a strong student take all three
</li>
</ul>
</li>
<li>
Applied BS
<ul>
<li>
I have less advice. Still good to take some subset of 
<ul>
<li>
315 (Numerical Analysis)
</li>
<li>
351 (Partial Differential Equations)
</li>
<li>
361 (Probability and Statistics)
</li>
</ul>
</li>
</ul>
</li>
<li>
math BA
<ul>
<li>
freestyle &ndash; electives, whatever interests you. 
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> If you are thinking of going to grad school in theoretical math </h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>
take the algebra and real analysis sequences as soon as possible. 
</li>
<li>
If there are any electives that you haven't taken (e.g., number theory) try to take those too.
</li>
<li>
The math subject GRE is very important; top 5 pure math grad schools (e.g., Berkeley) don't accept anyone under 80th percentile. 
</li>
<li>
To get into a good program, you need
<ul>
<li>
a very good GPA
</li>
<li>
a very good math subject GRE scores
</li>
<li>
some other things to distinguish you
<ul>
<li>
Do an REU (or two); list <a href="http://www.nsf.gov/crssprgm/reu/list_result.cfm?unitid=5044">here</a>. (Grad programs favor people with REU's over internships.)
</li>
<li>
NSA summer program
</li>
<li>
CCR summer program
</li>
<li>
Take a few graduate level courses. (This is also a good indicator of whether you will enjoy doing a phd)
</li>
<li>
There is also an option of doing a MS/BS; basically your senior year you will take a few grad courses and write a mini thesis. (Getting into the MS/BS program requires both a good record and recommendations from your professors. Basically they need to convince the committee that you can handle grad courses and write a decent thesis.)
</li>
<li>
think about studying abroad (BSM, Math in Moscow)
</li>
<li>
get a double digit score on the Putnam. Be active in the Putnam preparation group
</li>
<li>
do well on the Mathematical Modeling competition
</li>
<li>
take an independent study in some topic outside of the core curriculum
</li>
</ul>
</li>
<li>
In the meantime, I'm collecting links for undergraduates interested in theoretical math; check them out <a href="http://www.nsf.gov/crssprgm/reu/list_result.cfm?unitid=5044">here</a>.
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>
</body>
</html>
